lattera/openbsd/libexec/login_krb5/login_krb5.8
.\" $OpenBSD: src/libexec/login_krb5/login_krb5.8,v 1.16 2012/02/01 17:32:59 sobrado Exp $
.\"
.\" Copyright (c) 2000 Todd C. Miller <Todd.Miller@courtesan.com>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt LOGIN_KERBEROS 8
.Os
.Sh NAME
.Nm login_krb5
.Nd provide KerberosV authentication type
.Sh SYNOPSIS
.Nm login_krb5
.Bk -words
.Op Fl s Ar service
.Op Fl v Ar login Ns = Ns Li yes Ns | Ns Li no
.Op Fl v Ar notickets Ns = Ns Li yes Ns | Ns Li no
.Op Fl v Ar invokinguser Ns = Ns Ar user
.Ar user
.Op Ar class
.Ek
.Sh DESCRIPTION
The
.Nm
utility implements the KerberosV authentication mechanism.
It is called by
.Xr login 1 ,
.Xr su 1 ,
.Xr ftpd 8 ,
and others to authenticate the
.Ar user
with KerberosV.
.Pp
The
.Ar user
argument is the user's name to be authenticated.
.Pp
The
.Ar service
argument specifies which protocol to use with the
invoking program.
The allowed protocols are
.Em login ,
.Em challenge ,
and
.Em response .
(The
.Em challenge
protocol is silently ignored but will report success as KerberosV
authentication is not challenge-response based).
.Pp
If
.Ar invokinguser
is set and the
.Ar user
argument is root, the principal
invokinguser/root will be used for authentication.
.Pp
If the
.Ar notickets
argument is equal to
.Dq no ,
the default value, and the
.Ar login
argument is equal to
.Dq yes ,
then the ticket will be saved in a credentials cache.
.Pp
The
.Ar class
argument is ignored for compatibility with other login scripts.
.Pp
.Nm
will prompt the user for a password and report back to the
invoking program whether or not the authentication was
successful.
.Sh SEE ALSO
.Xr login 1 ,
.Xr passwd 1 ,
.Xr su 1 ,
.Xr login.conf 5 ,
.Xr ftpd 8 ,
.Xr kerberos 8 ,
.Xr login_krb5-or-pwd 8
