lattera/openbsd/share/man/man4/man4.vax/smg.4
.\"	$OpenBSD: src/share/man/man4/man4.vax/smg.4,v 1.8 2008/03/31 12:43:41 jmc Exp $
.\"
.\" Copyright (c) 2003 Jason L. Wright (jason@thought.net)
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SMG 4 vax
.Os
.Sh NAME
.Nm smg
.Nd Small Monochrome Graphics frame buffer
.Sh SYNOPSIS
.Cd "smg0 at vsbus0 csr 0x200f0000"
.Cd "wsdisplay* at smg?"
.Sh DESCRIPTION
The
.Nm
is a monochrome frame buffer found on-board most VAXstation 3100 systems.
.Pp
The
.Nm
driver interfaces the frame buffer with the
.Xr wscons 4
console framework.
It does not provide direct device driver entry points
but makes its functions available via the internal
.Xr wsdisplay 4
interface.
.Pp
When a color option board (either a
.Xr gpx 4
or a spx frame buffer) is installed, the
.Nm
driver will not attach by default, since the color option takes over the
video connector on the back of the system.
However, the output signal pins are independent, and it is possible to
connect a monochrome video cable even if a color option board is installed.
To force the
.Nm
driver to attach in this case, change the device flags to 1.
It will however not be possible to use the monochrome frame buffer
as the
.Ox
console in this case.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr vsbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
