lattera/openbsd/usr.sbin/sdio/sdio.8
.\"	$OpenBSD: src/usr.sbin/sdio/sdio.8,v 1.5 2013/07/16 11:13:34 schwarze Exp $
.\"
.\" Uwe Stuehler, 2006. Public Domain.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SDIO 8
.Os
.Sh NAME
.Nm sdio
.Nd SD/MMC/SDIO interface
.Sh SYNOPSIS
.Nm sdio
.Fl c Ar index argument response_type
.Op Ar data ...
.Nm sdio
.Fl d Ar debug_flags
.Sh DESCRIPTION
The
.Nm
program provides command-level access to SD/MMC and SDIO cards.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Xo
.Fl c Ar index argument response_type
.Op Ar data ...
.Xc
Sends arbitrary commands to the card.
.It Fl d Ar debug_flags
The
.Fl d
option sets the debug level for the SD/MMC subsystem and
.Ar debug_flags
is a 16-bit value.
The low byte sets the debug level for
.Xr sdmmc 4 ,
the high byte sets the debug level for
.Xr sdhc 4
or other host controller drivers.
.El
.\" .Sh MMC/SD/SDIO COMMANDS
.Sh SEE ALSO
.Xr intro 8
.Sh HISTORY
The
.Nm
program first appeared in
.Ox 4.1 .
.Sh AUTHORS
.An -nosplit
The
.Nm
program was written by
.An Uwe Stuehler Aq Mt uwe@openbsd.org .
