lattera/openbsd/sys/arch/socppc/stand/mkboot/mkboot.8
.\"     $OpenBSD: src/sys/arch/socppc/stand/mkboot/mkboot.8,v 1.3 2009/01/31 21:10:09 grange Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 16 2008 $
.Dt MKBOOT 8 socppc
.Os
.Sh NAME
.Nm mkboot
.Nd create U-Boot files
.Sh SYNOPSIS
.Nm mkboot
.Op Fl e Ar entry
.Op Fl l Ar loadaddr
.Ar infile outfile
.Sh DESCRIPTION
The
.Nm
utility creates images suitable for loading using the U-Boot bootloader.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl e Ar entry
Sets the entry point to
.Ar entry .
.It Fl l Ar loadaddr
Sets the load address to
.Ar loadaddr .
.El
.Sh HISTORY
A
.Nm
utility first appeared in
.Ox 4.4 .
