lattera/openbsd/share/man/man4/man4.sparc64/core.4
.\"     $OpenBSD: src/share/man/man4/man4.sparc64/core.4,v 1.1 2008/07/13 15:27:57 kettenis Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt CORE 4 sparc64
.Os
.Sh NAME
.Nm core
.Nd processor core
.Sh SYNOPSIS
.Cd "core* at cmp?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the chip multi-threading processors that have
multiple threads such as the Fujitsu SPARC64-VI processors.
It is not a physical device as such, but an abstraction to attach
individual CPU threads.
.Sh SEE ALSO
.Xr code 4 ,
.\".Xr cpu 4 ,
.Xr intro 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq kettenis@openbsd.org .
