lattera/openbsd/share/man/man4/man4.sparc64/environ.4
.\"     $OpenBSD: src/share/man/man4/man4.sparc64/environ.4,v 1.3 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 18 2008 $
.Dt ENVIRON 4 sparc64
.Os
.Sh NAME
.Nm environ
.Nd SPARC64 temperature sensor
.Sh SYNOPSIS
.Cd "environ* at fhc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the temperature sensor found on the boards of
Sunfire, Starfire, and Wildfire UltraSPARC systems.
The temperature readings are made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr fhc 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
