lattera/openbsd/usr.sbin/fw_update/fw_update.1
.\" $OpenBSD: src/usr.sbin/fw_update/fw_update.1,v 1.9 2013/07/16 11:13:33 schwarze Exp $
.\"
.\" Copyright (c) 2011 Alexander Hall <alexander@beard.se>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: August 2 2011 $
.Dt FW_UPDATE 1
.Os
.Sh NAME
.Nm fw_update
.Nd install and update non-free firmware packages
.Sh SYNOPSIS
.Nm
.Op Fl nv
.Sh DESCRIPTION
The
.Nm
utility checks which firmware are needed on the system and then
installs or updates the relevant packages from the Internet.
Since firmware with acceptable licenses are already present in
.Ox ,
.Nm
exists purely to install and update firmware that may not be freely
distributed with
.Ox .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl n
Pass the
.Fl n
flag to
.Xr pkg_add 1 ,
causing it to not actually install any firmware packages,
just report the steps that would be taken if it was.
.It Fl v
Turn on verbose output and pass the
.Fl v
flag to
.Xr pkg_add 1 .
This flag can be specified multiple times for increased
.Xr pkg_add 1
verbosity.
.El
.Sh SEE ALSO
.Xr pkg_add 1 ,
.Xr dmesg 8
.Sh AUTHORS
.An -nosplit
The
.Nm
program was written by
.An Alexander Hall Aq Mt alexander@beard.se .
