lattera/openbsd/share/man/man4/man4.socppc/socpcic.4
.\"     $OpenBSD: src/share/man/man4/man4.socppc/socpcic.4,v 1.1 2008/05/19 20:25:50 kettenis Exp $
.\"
.\" Copyright (c) 2008 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt SOCPCIC 4 socppc
.Os
.Sh NAME
.Nm socpcic 
.Nd socppc onboard PCI controller
.Sh SYNOPSIS
.Cd socpcic0 at obio? addr 0x08300
.Cd socpcic1 at obio? addr 0x08380
.Cd "pci0 at socpcic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the PCI controlle found on the Freescale
MPC8349E processor familiy.
This device is largely transparent and provides no user accessible
entry points.
.Sh SEE ALSO
.Xr mainbus 4 ,
.Xr pci 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
