lattera/openbsd/share/man/man4/man4.hp300/tvrx.4
.\"	$OpenBSD: src/share/man/man4/man4.hp300/tvrx.4,v 1.5 2013/01/18 21:19:10 miod Exp $
.\"
.\" Copyright (c) 2006, Miodrag Vallat
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT,
.\" INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
.\" STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
.\" ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: December 30 2011 $
.Dt TVRX 4 hp300
.Os
.Sh NAME
.Nm tvrx
.Nd HP98705 PersonalVRX
.Dq TigerShark
frame buffer
.Sh SYNOPSIS
.Cd "tvrx*      at dio?"
.Cd "wsdisplay* at tvrx?"
.Sh DESCRIPTION
The PersonalVRX frame buffer is an accelerated, high resolution
.Pq 1280x1024
external display, connected to a 98702 DIO-II interface board.
The external display is composed of one (66570) or two (66570 with 66571 option)
8-bit color frame buffer boards.
Other option boards for the PersonalVRX family include the 66572
.Sq Z-buffer ,
the
66573
.Sq Transform Engine and Scan
board, and the 66574
.Sq Colormap .
All models also have four overlay planes.
.Pp
The
.Nm
driver provides a frame buffer abstraction to the
.Xr wscons 4
console framework.
.Pp
Currently, the driver can only use the overlay planes, and will run as an
unaccelerated 16 color frame buffer.
.Pp
2D acceleration is not available until the appropriate microcode has been
downloaded into the framebuffer control logic; unfortunately, neither
the microcode nor documentation about the download interface seem to be
available.
.Pp
The PersonalVRX devices can be configured using the 5 DIP switches selector on
the interface board to define the
.Dq select code .
The select code value is computed by adding 133 to the number made from the
five binary digits.
The default settings, with the two MSB switches set to 1 and the three LSB
switches set to 0, provide a select code of 157.
.Sh SEE ALSO
.Xr dio 4 ,
.Xr intro 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
