lattera/openbsd/share/man/man4/man4.loongson/stsec.4
.\"	$OpenBSD: src/share/man/man4/man4.loongson/stsec.4,v 1.1 2010/02/24 22:16:16 miod Exp $
.\"
.\" Copyright (c) 2010 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt STSEC 4 loongson
.Os
.Sh NAME
.Nm stsec
.Nd ST7 Embedded Controller
.Sh SYNOPSIS
.Cd "stsec* at iic?"
.Sh DESCRIPTION
The
.Nm
driver supports the ST7FOX1 embedded controller found on the Gdium Liberty
netbook.
.Pp
This chip is used to control battery charge and discharge.
It also reports the lid status, as well as the state of the power and wavelan
radio enable buttons.
.Pp
Battery status and charge information is made available through the
.Xr sysctl 3
hardware sensor interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
