lattera/openbsd/share/man/man4/man4.alpha/esp.4
.\"	$OpenBSD: src/share/man/man4/man4.alpha/Attic/esp.4,v 1.3 1999/07/09 13:35:44 aaron Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All rights reserved.
.\"
.\"
.Dd March 4, 1998
.Dt ESP 4 alpha
.Os
.Sh NAME
.Nm esp
.Nd ESP NCR 53c[f]94 on-board SCSI controller
.Sh SYNOPSIS
.Cd "esp0 at tcds? slot ? " Pq "TurboChannel Alpha systems"
.Cd "esp1 at tcds? slot ? " Pq "TurboChannel Alpha systems"
.Sh DESCRIPTION
The
.Nm
is an on-board SCSI controller based on the NCR 53c[f]94 chips, found
on DEC 3000/[3456789]00 series Alpha workstations.
.Sh BUGS
Both on-board SCSI chips may or may not work at the same time.
.Sh SEE ALSO
.Xr intro 4
