lattera/openbsd/share/man/man4/man4.alpha/le.4
.\"     $OpenBSD: src/share/man/man4/man4.alpha/le.4,v 1.10 2006/03/12 17:29:48 martin Exp $
.\"
.\" Copyright (c) 1998 The OpenBSD Project
.\" All rights reserved.
.\"
.Dd March 7, 1998
.Dt LE 4 alpha
.Os
.Sh NAME
.Nm le
.Nd Alpha on-board LANCE Ethernet interface
.Sh SYNOPSIS
.Cd "le* at ioasic?" Pq "TURBOchannel Alphas"
.Cd "le* at tc?" Pq "TURBOchannel Alphas"
.Sh DESCRIPTION
The
.Nm
interface provides access to the Ethernet network via the
.Tn AMD
.Tn LANCE
Ethernet chip set.
.Pp
Each of the host's network addresses
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm
interface employs the address resolution protocol described in
.Xr arp 4
to dynamically map between Internet and Ethernet addresses on the local
network.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr ifmedia 4 ,
.Xr intro 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8
