lattera/openbsd/share/man/man4/man4.sgi/dsrtc.4
.\"	$OpenBSD: src/share/man/man4/man4.sgi/dsrtc.4,v 1.3 2009/11/16 20:13:13 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 18 2009 $
.Dt DSRTC 4 sgi
.Os
.Sh NAME
.Nm dsrtc
.Nd time-of-day clock
.Sh SYNOPSIS
.Cd "dsrtc0 at macebus0"
.Cd "dsrtc0 at ioc?"
.Cd "dsrtc0 at iof?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Dallas DS1687 and DS1742W realtime
clocks used on SGI systems.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ioc 4 ,
.Xr iof 4 ,
.Xr macebus 4
