lattera/openbsd/share/man/man4/man4.sgi/gbe.4
.\"     $OpenBSD: src/share/man/man4/man4.sgi/gbe.4,v 1.6 2009/04/22 08:16:11 sobrado Exp $
.\"
.\" Copyright (c) 2007, Joel Sing <jsing@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 27 2008 $
.Dt GBE 4 sgi
.Os
.Sh NAME
.Nm gbe
.Nd SGI Graphics Back End (GBE) frame buffer
.Sh SYNOPSIS
.Cd "gbe0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
driver provides support for the on-board Graphics Back End (GBE) frame
buffer found in SGI
.Tn O2
machines.
Console support is provided by the
.Xr wscons 4
console framework.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr mainbus 4 ,
.Xr wscons 4 ,
.Xr wsdisplay 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.3 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Joel Sing .
.Sh BUGS
Hardware initialization must currently be performed by the ARCS firmware.
The resolution configured by the firmware will be used, with a fixed
color depth of 8 bits.
