lattera/openbsd/share/man/man4/man4.sgi/iec.4
.\"	$OpenBSD: src/share/man/man4/man4.sgi/iec.4,v 1.1 2009/11/01 19:17:56 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt IEC 4 sgi
.Os
.Sh NAME
.Nm iec
.Nd IOC3 Ethernet interface
.Sh SYNOPSIS
.Cd "iec* at ioc?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 10/100 Mbit/s Ethernet controller
found on
.Xr ioc 4
devices.
.Sh SEE ALSO
.Xr arp 4 ,
.Xr intro 4 ,
.Xr ioc 4 ,
.Xr netintro 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.7 .
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat ,
.\" borrowing significant parts from the
.\" .Xr mec 4
.\" driver written by Izumi Tsutsui and Christopher Sekiya.
