lattera/openbsd/share/man/man4/man4.sgi/mainbus.4
.\"	$OpenBSD: src/share/man/man4/man4.sgi/Attic/mainbus.4,v 1.1 2007/11/28 16:27:29 jsing Exp $
.\"
.\" Copyright (c) 2007 Joel Sing <jsing@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt MAINBUS 4 sgi
.Os
.Sh NAME
.Nm mainbus
.Nd SGI main processor bus device
.Sh SYNOPSIS
.Cd "mainbus0 at root"
.Cd "cpu* at mainbus0"
.Cd "macebus0 at mainbus0"
.Cd "gbe0 at mainbus0"
.Sh DESCRIPTION
The
.Nm
interface serves as an abstraction used by the autoconfiguration system to help
find and attach buses or devices connected to the main processor bus.
.Pp
In SGI O2 machines,
.Nm
corresponds to the CRIME (CPU, Rendering, Interconnect and Memory Engine) bus
which acts as a bridge between the CPU, main memory, MACE (Multimedia,
Audio and Communications Engine) bus, Video Image Compression Engine (VICE)
and Graphics Back End (GBE).
.Sh SEE ALSO
.Xr autoconf 4 ,
.Xr gbe 4 ,
.Xr intro 4 ,
.Xr macebus 4
