lattera/openbsd/share/man/man4/man4.sgi/owmac.4
.\"	$OpenBSD: src/share/man/man4/man4.sgi/owmac.4,v 1.1 2009/05/17 22:08:34 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt OWMAC 4 sgi
.Os
.Sh NAME
.Nm owmac
.Nd 1-Wire Ethernet address
.Sh SYNOPSIS
.Cd "owmac* at onewire?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Dallas DS1981, DS1982 and DS2502
Add-only memory devices, found on SGI IOC3 devices.
.Pp
These devices are used to store the Ethernet address of the
.Nm ioc
Ethernet interface, when such an interface is present.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ioc 4 ,
.Xr onewire 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat .
