lattera/openbsd/share/man/man4/man4.sgi/xheart.4
.\"	$OpenBSD: src/share/man/man4/man4.sgi/xheart.4,v 1.2 2009/11/16 20:13:13 miod Exp $
.\"
.\" Copyright (c) 2009 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: May 17 2009 $
.Dt XHEART 4 sgi
.Os
.Sh NAME
.Nm xheart
.Nd Octane core system widget
.Sh SYNOPSIS
.Cd "xheart* at xbow?"
.Cd "onewire* at xheart?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the interrupt logic on Octane systems.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr onewire 4 ,
.Xr xbow 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.\" .Sh AUTHORS
.\" The
.\" .Nm
.\" driver was written by
.\" .An Miod Vallat .
