lattera/openbsd/share/man/man5/motd.5
.\"	$OpenBSD: src/share/man/man5/motd.5,v 1.9 2009/05/06 18:39:02 jmc Exp $
.\"	$NetBSD: motd.5,v 1.2 1994/12/28 18:58:53 glass Exp $
.\"
.\" This file is in the public domain.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt MOTD 5
.Os
.Sh NAME
.Nm motd
.Nd message of the day
.Sh DESCRIPTION
The
.Pa /etc/motd
file is normally displayed by
.Xr login 1
after a user has logged in but before the shell is run.
It is generally used for important system-wide announcements.
During system startup, a line containing the kernel version string
replaces all lines up to (but not including) the first blank line of
this file.
To keep any custom message intact, ensure that you leave two blank lines
at the top, or your message will be overwritten.
.Pp
Individual users may suppress the display of this file by creating a file named
.Pa .hushlogin
in their home directories.
.Sh FILES
.Bl -tag -width /etc/motd -compact
.It Pa /etc/motd
.El
.Sh EXAMPLES
.Bd -literal
OpenBSD 3.0 (GENERIC) #5: Sat Jan 26 20:13:07 MST 2002

Make sure you have a .forward file...

4/17	Machine will be down for backups all day Saturday.
.Ed
.Sh SEE ALSO
.Xr login 1
