lattera/openbsd/share/man/man4/adtfsm.4
.\"	$OpenBSD: src/share/man/man4/adtfsm.4,v 1.2 2012/07/12 20:12:03 jasper Exp $
.\"
.\" Copyright (c) 2008 Theo de Raadt <deraadt@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 22 2008 $
.Dt ADTFSM 4
.Os
.Sh NAME
.Nm adtfsm
.Nd Analog Devices ADT7462 temperature, voltage, and fan sensor
.Sh SYNOPSIS
.Cd "adtfsm* at iic?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Analog Devices ADT7462,
and family.
The sensor possesses a collection of sensor values which are
made available through the
.Xr sysctl 8
interface.
.Sh SEE ALSO
.Xr iic 4 ,
.Xr intro 4 ,
.Xr sensorsd 8 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.4 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Theo de Raadt Aq deraadt@openbsd.org .
