lattera/openbsd/share/man/man4/agp.4
.\" $OpenBSD: src/share/man/man4/agp.4,v 1.6 2014/03/14 23:57:03 kettenis Exp $
.\" Copyright (c) Owain Ainsworth <oga@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate: January 21 2014 $
.Dt AGP 4
.Os
.Sh NAME
.Nm agp
.Nd accelerated graphics port driver
.Sh SYNOPSIS
.Cd "agp* at vga?"
.Sh DESCRIPTION
The
.Nm
driver provides support for programming the AGP GART.
This support is used by
.Xr drm 4
kernel drivers.
.Sh SEE ALSO
.Xr drm 4 ,
.Xr inteldrm 4 ,
.Xr radeondrm 4 ,
.Xr vga 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Fx 4.1 .
It was adopted in
.Nx 1.6 .
The driver was then ported in parts to
.Ox ,
and fully integrated in
.Ox 4.3 .
The userland
.Xr ioctl 2
interface was removed in
.Ox 5.6 .
