lattera/openbsd/share/man/man4/arcofi.4
.\"	$OpenBSD: src/share/man/man4/arcofi.4,v 1.1 2011/12/21 23:12:02 miod Exp $
.\"
.\"
.\" Copyright (c) 2011 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt ARCOFI 4
.Os
.Sh NAME
.Nm arcofi
.Nd Siemens PSB2160 audio codec
.Sh SYNOPSIS
.Cd "arcofi* at dio?"
.Cd "arcofi* at gsc?"
.Cd "audio*  at arcofi?"
.Sh DESCRIPTION
The
.Nm
driver supports the HP
.Dq Audio1
audio devices, based upon the Siemens PSB2160
.Dq ARCOFI
codec, to implement the audio device interface described in
.Xr audio 4 .
.Pp
This device is found onboard HP 9000 workstations models 425e, 705 and 710.
.Pp
The
.Nm
is limited to a phone-quality mono, 8 bits, 8000 KHz sound.
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr audio 4 ,
.Xr dio 4 ,
.Xr gsc 4
.Xr intro 4
.Sh HISTORY
.Ox
support for
.Nm
first appeared in
.Ox 5.1 .
.Sh CAVEATS
Due to the
.Dq ARCOFI
chip being designed to build phones, it is not possible to unmute the
.Sq line in
channel while muting
.Em all
output channels.
Attempting to do this will cause all channels (input and output) to be unmuted.
