lattera/openbsd/share/man/man4/berkwdt.4
.\"	$OpenBSD: src/share/man/man4/berkwdt.4,v 1.1 2009/04/24 21:04:27 mk Exp $
.\"
.\" Copyright (c) 2009 Michael Knudsen <mk@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.Dd $Mdocdate$
.Dt BERKWDT 4
.Os
.Sh NAME
.Nm berkwdt
.Nd Berkshire Products PCI PC Watchdog
.Sh SYNOPSIS
.Cd "berkwdt0 at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Berkshire Products PCI PC Watchdog.
These devices contain a watchdog timer and general purpose digital inputs
and outputs, but currently only the watchdog timer is supported.
.Pp
.Nm
provides the standard
.Xr watchdog 4
interface and may be used with
.Xr watchdogd 8 .
The watchdog timer may be configured to a value from 1 second to 18
hours.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr watchdog 4 ,
.Xr sysctl 8 ,
.Xr watchdogd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.6 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Wim Van Sebroeck Aq wim@iguana.be .
