lattera/openbsd/share/man/man4/owtemp.4
.\"	$OpenBSD: src/share/man/man4/owtemp.4,v 1.6 2007/05/31 19:19:51 jmc Exp $
.\"
.\" Copyright (c) 2006 Alexander Yurchenko <grange@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt OWTEMP 4
.Os
.Sh NAME
.Nm owtemp
.Nd 1-Wire temperature device
.Sh SYNOPSIS
.Cd "owtemp* at onewire?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the 1-Wire temperature sensor.
The sensor possesses a single temperature value that can be accessed
through the
.Xr sysctl 8
interface.
.Pp
The following chips are supported by the driver:
.Pp
.Bl -bullet -compact -offset indent
.It
Maxim/Dallas DS1820/DS18S20/DS1920
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr onewire 4 ,
.Xr sysctl 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Alexander Yurchenko Aq grange@openbsd.org .
