lattera/openbsd/share/man/man4/qle.4
.\"	$OpenBSD: src/share/man/man4/qle.4,v 1.8 2014/03/16 08:28:55 deraadt Exp $
.\"
.\" Copyright (c) 2014 Jonathan Matthew <jmatthew@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 6 2014 $
.Dt QLE 4
.Os
.Sh NAME
.Nm qle
.Nd QLogic ISP2400/2500 Fibre Channel Controllers
.Sh SYNOPSIS
.Cd "qle* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for 4G and 8G QLogic Fibre Channel host bus
adapters using the ISP2400 and ISP2500 family of chipsets.
.Pp
.Nm
provides no ability to configure an adapter's parameters at runtime;
all configuration must be done prior to booting
.Ox .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr qla 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 5.5 .
.Sh AUTHORS
The
.Nm
driver was written by
.An Jonathan Matthew Aq Mt jmatthew@openbsd.org .
