lattera/openbsd/share/man/man4/sdmmc.4
.\"	$OpenBSD: src/share/man/man4/sdmmc.4,v 1.11 2013/07/16 16:05:49 schwarze Exp $
.\"
.\" Theo de Raadt, 2006. Public Domain.
.\"
.Dd $Mdocdate: November 30 2012 $
.Dt SDMMC 4
.Os
.Sh NAME
.Nm sdmmc
.Nd SD bus
.Sh SYNOPSIS
.Cd "# zaurus"
.Cd "sdmmc* at pxammc?"
.Cd "# all architectures"
.Cd "sdmmc* at rtsx?"
.Cd "sdmmc* at sdhc?"
.Sh DESCRIPTION
The
.Nm
subsystem provides machine-independent bus support and drivers for
SD/MMC devices.
.Pp
Standard SD/SDHC memory devices will show up as a fake SCSI disk, using
.Xr scsibus 4
and
.Xr sd 4 .
.Sh SEE ALSO
.Xr intro 4 ,
.Xr rtsx 4 ,
.Xr sbt 4 ,
.Xr scsibus 4 ,
.Xr sd 4 ,
.Xr sdhc 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Uwe Stuehler Aq Mt uwe@openbsd.org .
