lattera/openbsd/share/man/man4/sl.4
.\"	$OpenBSD: src/share/man/man4/sl.4,v 1.17 2013/06/02 20:23:34 tedu Exp $
.\"	$NetBSD: sl.4,v 1.1 1996/08/10 21:26:14 explorer Exp $
.\"
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     From:	@(#)lo.4	8.1 (Berkeley) 6/5/93
.\"
.Dd $Mdocdate: January 6 2008 $
.Dt SL 4
.Os
.Sh NAME
.Nm sl
.Nd slip network interface
.Sh SYNOPSIS
.Cd "pseudo-device sl"
.Sh DESCRIPTION
The
.Nm
interface allows serial lines to be used as network interfaces using the
.Em slip
protocol.
.Pp
An
.Nm
interface can be created at runtime using the
.Ic ifconfig sl Ns Ar N Ic create
command or by setting up a
.Xr hostname.if 5
configuration file for
.Xr netstart 8 .
.Pp
The following link-level options are configurable via
.Xr ifconfig 8 :
.Pp
.Bl -tag -width Ds -offset indent -compact
.It link0
Use Van Jacobsen TCP header compression.
.It link1
Suppress ICMP traffic.
.It link2
Auto-enable Van Jacobsen TCP header compression
(enabled by default).
.El
.Sh DIAGNOSTICS
.Bl -diag
.It sl0: afX not supported.
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
.El
.Sh SEE ALSO
.Xr inet 4 ,
.Xr netintro 4 ,
.Xr hostname.if 5 ,
.Xr ifconfig 8 ,
.Xr ldattach 8 ,
.Xr netstart 8 ,
.Xr sliplogin 8 ,
.Xr slstats 8
