lattera/openbsd/share/man/man4/sli.4
.\"	$OpenBSD: src/share/man/man4/sli.4,v 1.5 2012/08/14 01:08:19 dlg Exp $
.\"
.\" Copyright (c) 2007 David Gwynne <dlg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: March 22 2010 $
.Dt SLI 4
.Os
.Sh NAME
.Nm sli
.Nd Emulex LightPulse Fibre Channel SCSI interface
.Sh SYNOPSIS
.Cd "sli* at pci?"
.Sh DESCRIPTION
The
.Nm
driver provides support for the Emulex LightPulse Fibre Channel family of
controllers using the Service Level Interface.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr pci 4 ,
.Xr scsi 4
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 4.2 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An David Gwynne Aq dlg@openbsd.org .
