lattera/openbsd/share/man/man4/man4.mvme68k/pcctwo.4
.\"	$OpenBSD: src/share/man/man4/man4.mvme68k/pcctwo.4,v 1.3 2013/05/18 17:45:38 miod Exp $
.\"
.\" Copyright (c) 2003 Paul Weissmann
.\" All rights reserved.
.\"
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd $Mdocdate: March 2 2009 $
.Dt PCCTWO 4 mvme68k
.Os
.Sh NAME
.Nm pcctwo
.Nd PCCchip2 local bus controller
.Sh SYNOPSIS
.Cd "pcctwo0 at mainbus0 addr 0xfff00000"
.Sh DESCRIPTION
The
.Nm
PCCchip2 ASIC provides an interface to the different local bus-attached I/O
devices as found on the MVME166, MVME167, MVME176 and MVME177
Single-Board Computers.
.Pp
Features summary:
.Pp
.Bl -bullet -compact
.It
8-bit parallel I/O port
.It
Master/slave interface for
.Xr cl 4
Cirrus Logic CD2401 serial controller
.It
Host interface to
.Xr ie 4
Intel i82596CA LAN coprocessor
.It
Host interface to
.Xr osiop 4
Symbios/NCR 53C710 SCSI controller
.It
Interface to the
.Xr memc 4
Memory controller ASIC
.El
.Sh SEE ALSO
.Xr cl 4 ,
.Xr ie 4 ,
.Xr intro 4 ,
.Xr memc 4 ,
.Xr osiop 4
