lattera/openbsd/usr.sbin/afs/src/arlad/CellServDB.5
.\"     $OpenBSD: src/usr.sbin/afs/src/arlad/Attic/CellServDB.5,v 1.1 2000/09/11 14:40:39 art Exp $
.\"	$Id: CellServDB.5,v 1.1 2000/08/07 12:09:48 lha Exp $
.Dd April 19, 2000
.Dt CellServDB 5
.Os
.Sh NAME
.Nm CellServDB
.Nd AFS cells and database servers
.Sh DESCRIPTION
The file
.Nm
lists AFS cells known to the local AFS cache manager.
Each entry describes the name of an AFS cell and specifies the
servers for that cell.
.Pp
Here is an example of the format of an entry in the file:
.Bd -literal
>cellname               # Freetext comment describing the cell
ip-address              #first.server.for.cell
ip-address              #second.server.for.cell
ip-adresss              #third.server.for.cell
.Ed
.Pp
.Nm
is read when 
.Nm arlad
is started, normally when the system boots.
.Pp
The text after the # is NOT a comment, it the hostname of the db-server.
.Pp
Entires in the file are searched and expanded by many programs
.Sh FILES
.Pa CellServDB
.Sh SEE ALSO
.Xr arlad 1
