lattera/openbsd/share/man/man4/man4.mvme88k/dsrtc.4
.\"	$OpenBSD: src/share/man/man4/man4.mvme88k/dsrtc.4,v 1.1 2013/05/23 21:20:48 miod Exp $
.\"
.\" Copyright (c) 2013 Miodrag Vallat.
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate$
.Dt DSRTC 4 mvme88k
.Os
.Sh NAME
.Nm dsrtc
.Nd DS1216 SmartWatch ROM
.Sh SYNOPSIS
.Cd "dsrtc0 at angelfire0 offset 0x10000"
.Sh DESCRIPTION
The
.Nm
driver provides support for the
.Dq SmartWatch
battery-backed clock found on MVME180 and MVME181 systems.
.Sh SEE ALSO
.Xr angelfire 4 ,
.Xr intro 4
